In [2]:
import pandas as pd
import sqlite3 as sql

In [ ]:
db = sql.connect("chinook.sqlite")
cursor = db.cursor()

In [4]:
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
cursor.fetchall()

[]

In [8]:
cursor.execute("SELECT COUNT (*) FROM Genre")
cursor.fetchone()

(25,)

In [9]:
cursor.execute("PRAGMA table_info(Track);")
cursor.fetchall()

[(0, 'TrackId', 'INTEGER', 1, None, 1),
 (1, 'Name', 'NVARCHAR(200)', 1, None, 0),
 (2, 'AlbumId', 'INTEGER', 0, None, 0),
 (3, 'MediaTypeId', 'INTEGER', 1, None, 0),
 (4, 'GenreId', 'INTEGER', 0, None, 0),
 (5, 'Composer', 'NVARCHAR(220)', 0, None, 0),
 (6, 'Milliseconds', 'INTEGER', 1, None, 0),
 (7, 'Bytes', 'INTEGER', 0, None, 0),
 (8, 'UnitPrice', 'NUMERIC(10,2)', 1, None, 0)]

In [4]:
cursor.execute("SELECT * FROM Customer;")
cursor.fetchone()

(1,
 'Luís',
 'Gonçalves',
 'Embraer - Empresa Brasileira de Aeronáutica S.A.',
 'Av. Brigadeiro Faria Lima, 2170',
 'São José dos Campos',
 'SP',
 'Brazil',
 '12227-000',
 '+55 (12) 3923-5555',
 '+55 (12) 3923-5566',
 'luisg@embraer.com.br',
 3)

In [14]:
df = pd.read_sql("SELECT * FROM Customer LIMIT 5;", db, index_col="CustomerId")
df

,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
CustomerId,,,,,,,,,,,,
1,Luís,Gonçalves,Embraer - Empresa Brasileira de Aeronáutica S.A.,"Av. Brigadeiro Faria Lima, 2170",São José dos Campos,SP,Brazil,12227-000,+55 (12) 3923-5555,+55 (12) 3923-5566,luisg@embraer.com.br,3
2,Leonie,Köhler,None,Theodor-Heuss-Straße 34,Stuttgart,None,Germany,70174,+49 0711 2842222,None,leonekohler@surfeu.de,5
3,François,Tremblay,None,1498 rue Bélanger,Montréal,QC,Canada,H2G 1A7,+1 (514) 721-4711,None,ftremblay@gmail.com,3
4,Bjørn,Hansen,None,Ullevålsveien 14,Oslo,None,Norway,0171,+47 22 44 22 22,None,bjorn.hansen@yahoo.no,4
5,František,Wichterlová,JetBrains s.r.o.,Klanova 9/506,Prague,None,Czech Republic,14700,+420 2 4172 5555,+420 2 4172 5555,frantisekw@jetbrains.com,4

In [17]:
df = pd.read_sql("SELECT * FROM Artist;", db, index_col="ArtistId")
df.head(10)

                          Name
ArtistId
1                        AC/DC
2                       Accept
3                    Aerosmith
4            Alanis Morissette
5              Alice In Chains
6         Antônio Carlos Jobim
7                 Apocalyptica
8                   Audioslave
9                     BackBeat
10                Billy Cobham

In [24]:
df = pd.read_sql("SELECT CustomerId, FirstName, City FROM Customer LIMIT 10;", db, index_col="CustomerId")
df

            FirstName                 City
CustomerId
1                Luís  São José dos Campos
2              Leonie            Stuttgart
3            François             Montréal
4               Bjørn                 Oslo
5           František               Prague
6              Helena               Prague
7              Astrid               Vienne
8                Daan             Brussels
9                Kara           Copenhagen
10            Eduardo            São Paulo

### Ordering & sorting

In [4]:
command = "SELECT CustomerId, FirstName, LastName, Phone, City FROM Customer ORDER BY FirstName LIMIT 10;"
df = pd.read_sql(command, db, index_col="CustomerId")
df

            FirstName   LastName                Phone           City
CustomerId
32              Aaron   Mitchell    +1 (204) 452-6452       Winnipeg
11          Alexandre      Rocha   +55 (11) 3055-3278      São Paulo
7              Astrid     Gruber       +43 01 5134505         Vienne
4               Bjørn     Hansen      +47 22 44 22 22           Oslo
39            Camille    Bernard   +33 01 49 70 65 65          Paris
8                Daan    Peeters     +32 02 219 03 03       Brussels
20                Dan     Miller    +1 (650) 644-3358  Mountain View
56              Diego  Gutiérrez  +54 (0)11 4311 4333   Buenos Aires
40          Dominique   Lefebvre   +33 01 47 42 71 71          Paris
10            Eduardo    Martins   +55 (11) 3033-5446      São Paulo

In [5]:
command = "SELECT DISTINCT Country from Customer;"
cursor.execute(command)
cursor.fetchall()

[('Brazil',),
 ('Germany',),
 ('Canada',),
 ('Norway',),
 ('Czech Republic',),
 ('Austria',),
 ('Belgium',),
 ('Denmark',),
 ('USA',),
 ('Portugal',),
 ('France',),
 ('Finland',),
 ('Hungary',),
 ('Ireland',),
 ('Italy',),
 ('Netherlands',),
 ('Poland',),
 ('Spain',),
 ('Sweden',),
 ('United Kingdom',),
 ('Australia',),
 ('Argentina',),
 ('Chile',),
 ('India',)]

### Filtering

In [6]:
query = "SELECT * FROM Customer WHERE Country='Norway'"
pd.read_sql(query, db)

,CustomerId,FirstName,LastName,Company,Address,City,State,Country,PostalCode,Phone,Fax,Email,SupportRepId
0,4,Bjørn,Hansen,None,Ullevålsveien 14,Oslo,None,Norway,0171,+47 22 44 22 22,None,bjorn.hansen@yahoo.no,4

In [7]:
db.close()